In [46]:
!mkdir -p ~/aiffel/data_analysis_basic/data
!ln -s ~/data/* ~/aiffel/data_analysis_basic/data

ln: failed to create symbolic link '/aiffel/aiffel/data_analysis_basic/data/sales_05_8.csv': File exists

In [47]:
# Pandas, Numpy, Matplotlib, Seaborn을 호출
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('default')
import seaborn as sns
import datetime as dt

# sales_data 변수를 만들고 sales_05.csv 값을 할당
sales_data = pd.read_csv('~/aiffel/data_analysis_basic/data/sales_05_8.csv')

# sales_data의 head 값 확인하기
sales_data.head()

      Install  Time_stamp    Status            ID  Payment       Game_Name
0  2022-01-14  2022-01-27  purchase     Heidi_635    19900  Soccer Manager
1  2022-03-10  2022-03-13  purchase  Courtney_067      900     Mine Ground
2  2022-02-13  2022-02-19  purchase     David_737     9900  Soccer Manager
3  2022-02-07  2022-02-25  purchase   Lindsay_820     4900     Mine Ground
4  2022-03-06  2022-03-10  purchase       Jon_823    49900  Soccer Manager

In [48]:
sales_data.info()
sales_data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75087 entries, 0 to 75086
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Install     75087 non-null  object
 1   Time_stamp  75087 non-null  object
 2   Status      75087 non-null  object
 3   ID          75087 non-null  object
 4   Payment     75087 non-null  int64
 5   Game_Name   75087 non-null  object
dtypes: int64(1), object(5)
memory usage: 3.4+ MB

            Payment
count  75087.000000
mean    3531.114574
std     8690.145281
min        0.000000
25%        0.000000
50%        0.000000
75%      900.000000
max    49900.000000

In [49]:
len(sales_data)

75087

In [50]:
len(sales_data['ID'])

75087

In [51]:
len(sales_data['ID'].unique())

52672

In [52]:
sales_data

          Install  Time_stamp    Status            ID  Payment       Game_Name
0      2022-01-14  2022-01-27  purchase     Heidi_635    19900  Soccer Manager
1      2022-03-10  2022-03-13  purchase  Courtney_067      900     Mine Ground
2      2022-02-13  2022-02-19  purchase     David_737     9900  Soccer Manager
3      2022-02-07  2022-02-25  purchase   Lindsay_820     4900     Mine Ground
4      2022-03-06  2022-03-10  purchase       Jon_823    49900  Soccer Manager
...           ...         ...       ...           ...      ...             ...
75082  2022-04-12  2022-04-20      play    Harold_873        0  Soccer Manager
75083  2022-01-29  2022-02-03      play      Mark_684        0     Mine Ground
75084  2022-01-11  2022-01-18      play       Roy_084        0  Soccer Manager
75085  2022-01-09  2022-01-23      play     Erika_151        0     Mine Ground
75086  2022-02-18  2022-02-28      play  Franklin_013        0     Mine Ground

[75087 rows x 6 columns]

In [53]:
sales_data.loc[0]

Install           2022-01-14
Time_stamp        2022-01-27
Status              purchase
ID                 Heidi_635
Payment                19900
Game_Name     Soccer Manager
Name: 0, dtype: object

In [54]:
sales_data['Now'] = '2022-06-10'
# sal_d['Now'] = pd.to_datetime(sales_data['Now'])

In [55]:
sales_data['Now'] = pd.to_datetime(sales_data['Now'])
sales_data['Time_stamp'] = pd.to_datetime(sales_data['Time_stamp'])

In [56]:
sales_data = sales_data[sales_data['Status'] == 'purchase']
sales_data.info()
sales_data.describe()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 27682 entries, 0 to 27681
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Install     27682 non-null  object
 1   Time_stamp  27682 non-null  datetime64[ns]
 2   Status      27682 non-null  object
 3   ID          27682 non-null  object
 4   Payment     27682 non-null  int64
 5   Game_Name   27682 non-null  object
 6   Now         27682 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 1.7+ MB

            Payment
count  27682.000000
mean    9578.094068
std    12121.351082
min      900.000000
25%      900.000000
50%     4900.000000
75%     9900.000000
max    49900.000000

In [57]:
sales_data

,Install,Time_stamp,Status,ID,Payment,Game_Name,Now
0,2022-01-14,2022-01-27,purchase,Heidi_635,19900,Soccer Manager,2022-06-10
1,2022-03-10,2022-03-13,purchase,Courtney_067,900,Mine Ground,2022-06-10
2,2022-02-13,2022-02-19,purchase,David_737,9900,Soccer Manager,2022-06-10
3,2022-02-07,2022-02-25,purchase,Lindsay_820,4900,Mine Ground,2022-06-10
4,2022-03-06,2022-03-10,purchase,Jon_823,49900,Soccer Manager,2022-06-10
...,...,...,...,...,...,...,...
27677,2022-05-11,2022-05-30,purchase,Debra_720,900,Mine Ground,2022-06-10
27678,2022-04-26,2022-04-28,purchase,Kevin_404,900,Soccer Manager,2022-06-10
27679,2022-03-30,2022-04-09,purchase,Roberto_426,9900,Mine Ground,2022-06-10
27680,2022-05-09,2022-05-27,purchase,Craig_278,4900,Mine Ground,2022-06-10
27681,2022-03-17,2022-04-06,purchase,Madison_120,900,Soccer Manager,2022-06-10

In [58]:
sales_data['Interval'] = sales_data['Now'] - sales_data['Time_stamp']

/tmp/ipykernel_37/296579985.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data['Interval'] = sales_data['Now'] - sales_data['Time_stamp']

In [59]:
# RFM_data 변수를 만들고 Groupby()함수를 이용해서 Recency, Frequency, Monetary 집계하기
RFM_data = sales_data.groupby(['ID']).agg({'Interval':'min','ID': 'count', 'Payment': 'sum'})

# RFM_data의 열 값을 각각 Recency, Frequency, Monetary로 변경
RFM_data.columns = ['Recency', 'Frequency', 'Monetary']
RFM_data.head()

           Recency  Frequency  Monetary
ID
Aaron_027  60 days          5     40500
Aaron_031 102 days          5     17500
Aaron_077  40 days          4     26600
Aaron_165  21 days          4     49600
Aaron_224 108 days          1       900

In [60]:
# RFM_data의 Recency 열 값을 숫자로 변경
RFM_data['Recency'] = RFM_data['Recency'].dt.days
RFM_data

             Recency  Frequency  Monetary
ID
Aaron_027         60          5     40500
Aaron_031        102          5     17500
Aaron_077         40          4     26600
Aaron_165         21          4     49600
Aaron_224        108          1       900
...              ...        ...       ...
Zachary_937      101          4     11600
Zachary_948       48          5     26500
Zoe_163           11          5    105500
Zoe_536           88          1       900
Zoe_638          117          3     25700

[5267 rows x 3 columns]

In [ ]:
ax = sns.boxplot(data=temp_var, x='Recency')
plt.title('Recency Box plot')
plt.show()

In [ ]:
# RFM_data의 R_score열을 만들고, Recency열 값을 기준으로 1부터 100까지의 실수로 정규화합니다. 
RFM_data['R_score'] = np.interp(RFM_data['Recency'], (RFM_data['Recency'].min(), RFM_data['Recency'].max()), (100, 1)).round(2)

# 만들어진 RFM_data의 Head 값을 확인합니다. 
RFM_data.head()

In [ ]:
# RFM_data에 Class열을 만들고, RFM_score와 지정한 분위값 범위에 따라 labels 값을 입력합니다

RFM_data["Class"] = pd.qcut(RFM_data['RFM_score'], q=[0, 0.4, 0.65, 0.85, 0.99, 1], labels=[5,4,3,2,1])

In [ ]:
# RFM_data의 Recency열 값을 내림차순(높은값에서 낮은 값 순서로)으로 정렬
temp_var = RFM_data.sort_values(by=['Recency'], ascending=False)
temp_var.head()

In [ ]:
# Class가 입력된 RFM_data의 인덱스를 재정렬합니다.
RFM_data = RFM_data.reset_index()
RFM_data

In [ ]:
# R_score와 M_score를 기준으로 산포도(scatter) 그리기
sns.scatterplot(data=RFM_data, x='R_score', y='M_score', hue='Class')
plt.title('Customer By Class')
plt.show()

In [ ]:
# 집계된 temp_var의 MultiIndex를 NormalIndex로 변환합니다. 
temp_var.index = temp_var.index.tolist()
temp_var

In [ ]:
# 각 Class별 평균 Monetary를 시각화합니다. 
ax = sns.barplot(data=temp_var, x='Class', y='Monetary')
containers = ax.containers[0]
ax.bar_label(containers, labels=[f'{x:,.0f}' for x in containers.datavalues], label_type='center')
plt.title('Monetary By Class')
plt.show()

In [ ]:
VIP_customer = RFM_data[RFM_data['Class'] == 1]
VIP_customer = VIP_customer.reset_index(drop=True)

VIP_customer

In [63]:
sns.color_palette()

In [66]:
import matplotlib.cm

print(matplotlib.cm.cmap_d.keys())

KeysView(<matplotlib.cm._DeprecatedCmapDictWrapper object at 0x7f4e95837760>)